# Table of Contents

1. Find and address mixed type variables in a dataframe
2. Find and address missing values in a dataframe
3. Find and address duplicate values in a dataframe
4. Exercise Start:
 - check for mixed type data
 - check for missing data
 - check for duplicate data

In [33]:
# import libraries
import pandas as pd
import numpy as np
import os

In [34]:
# set path and import data 

path = r'C:\Users\Jenna\Desktop\Data Course\Part4_Instacart_analysis\02_Data'

df_prods = pd.read_csv(os.path.join(path, 'Original_Data', 'products.csv'), index_col = False)


df_ords = pd.read_csv(os.path.join(path, 'Prepared_Data', 'orders_wrangled.csv'), index_col = 0)

In [35]:
# create a dataframe

df_test = pd.DataFrame()

In [36]:
# create a mixed type column

df_test['mix']= ['a','b', 1, True]

In [37]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [38]:
# check for mixed columns

for col in df_test.columns.tolist():
    weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis=1)
    if len (df_test[weird]) > 0:
        print (col)

mix

In [39]:
# declare the data type for mix column

df_test['mix'] = df_test['mix'].astype('str')

In [40]:
# check for missing data in products data frame

df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [41]:
# create a data frame with missing results from products

df_nan = df_prods[ df_prods['product_name'].isnull() == True]

df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [42]:
# check the before row number 
df_prods.shape

(49693, 5)

In [43]:
# make a new dataframe with out missing values

df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [44]:
# check the after row number 
df_prods_clean.shape

(49677, 5)

In [45]:
# find duplicates in the data

df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [46]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [47]:
# new data frame with no duplicates

df_prods_clean_nodups = df_prods_clean.drop_duplicates()

In [48]:
# check after
df_prods_clean_nodups.shape

(49672, 5)

In [49]:
df_prods_clean_nodups.to_csv(os.path.join(path, "Prepared_Data",'products_checked.csv'))

# Exercise Start 4.5

### Question 1: describe the orders data frame

In [53]:
# check stats for orders dataframe

df_ords.describe()

,order_id,user_id,user_order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

### Question 1:this data looks okay, we can check for accuracy in the min and max of order hour and order day and they both look rational

### Question 2: Check for mixed data type

In [58]:
# run the code from the exercise to check for mixed data types

for col in df_ords.columns.tolist():
    weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis=1)
    if len (df_ords[weird]) > 0:
        print (col)

### Question 2:  There does not appear to by any mixed data columns

### Question 3: Check for missing data

In [59]:
# this function will give total of rows with missing values in each column

df_ords.isnull().sum()

order_id                       0
user_id                        0
user_order_number              0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

### Question 3/4: there are only empty values in the days since prior order column. This is valid as some users may have only had one order. I will leave these rows untouched

### Question 5: find duplicates in orders data

In [63]:
# make a new dataframe that contains on the data that is duplicate across all columns

df_ords_dups = df_ords[df_ords.duplicated()]

# print the duplicate data 
df_ords_dups

Empty DataFrame
Columns: [order_id, user_id, user_order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order]
Index: []

### Question 5: There does not appear to be any duplicates, but if there was we could make a new dataframe that drops out the duplicates as in the exercise

### The df_prods is exported as above, and I did not make any changes to df_ords